app/Views/siswa/dashboard.php

                                    <?php
                                        $siswaKelasModel = new \App\Models\SiswaKelasModel();
                                        $userId = session()->get('id');
                                        $jumlahKelas = $siswaKelasModel->where('id_user', $userId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `siswa_kelas`
WHERE `id_user` = '9'