app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'geto'
 LIMIT 1
---
    public function loginProcess()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();