app/Controllers/Kelas.php

SELECT *
FROM `users`
WHERE `users`.`id` = '19'
---
    public function editProfil()
    {
        $userModel = new \App\Models\UserModel();
        $id = session()->get('id');

        $guru = $userModel->find($id);