app/Controllers/Kelas.php

SELECT *
FROM `kelas`
WHERE `id` = 21
AND `id_guru` = '5'
 LIMIT 1
---
    private function getOwnedKelas(int $idKelas): ?array
    {
        $kelasModel = new KelasModel();

        return $kelasModel
            ->where('id', $idKelas)
            ->where('id_guru', session()->get('id'))
            ->first();

SELECT *
FROM `kelas`
WHERE `id_guru` = '5'
ORDER BY `id` DESC
---
    public function index()
    {
        if ($redirect = $this->ensureGuru()) {
            return $redirect;
        }

        $kelasModel = new KelasModel();

        $kelas = $kelasModel
            ->where('id_guru', session()->get('id'))
            ->orderBy('id', 'DESC')
            ->findAll();

SELECT *
FROM `materi`
WHERE `id_kelas` = '21'
---
    public function hapus($idKelas)
    {
        if ($redirect = $this->ensureGuru()) {
            return $redirect;
        }

        $kelas = $this->getOwnedKelas((int) $idKelas);

        if (! $kelas) {
            return redirect()
                ->to('/kelas')
                ->with('error', 'Kelas tidak ditemukan atau Anda tidak memiliki akses.');
        }

        $kelasModel = new KelasModel();
        $materiModel = new MateriModel();

        $materiList = $materiModel
            ->where('id_kelas', $idKelas)
            ->findAll();

DELETE FROM `materi`
WHERE `id_kelas` = '21'
DELETE FROM `kelas`
WHERE `id` IN ('21')
---
            }
        }

        $materiModel->where('id_kelas', $idKelas)->delete();
        $kelasModel->delete($idKelas);

INSERT INTO `materi` (`id_kelas`, `judul`, `deskripsi`, `file`, `created_at`, `updated_at`) VALUES (21, 'slice', 'slice', NULL, '2026-06-07 13:13:36', '2026-06-07 13:13:36')
---

        $materiModel = new MateriModel();

        $materiModel->insert([
            'id_kelas'  => $idKelas,
            'judul'     => trim((string) $this->request->getPost('judul')),
            'deskripsi' => trim((string) $this->request->getPost('deskripsi')),
            'file'      => $fileName,
        ]);

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
    public function editProfil()
    {
        if ($redirect = $this->ensureGuru()) {
            return $redirect;
        }

        $userModel = new UserModel();
        $idGuru = session()->get('id');

        $guru = $userModel->find($idGuru);

UPDATE `users` SET `nama` = 'Levi Ackerman 1', `username` = 'levi'
WHERE `users`.`id` IN ('5')
---
            $data['password'] = password_hash($password, PASSWORD_DEFAULT);
        }

        $userModel->update($idGuru, $data);