app/Controllers/Materi.php

SELECT *
FROM `kelas`
WHERE `id` = 21
AND `id_guru` = '5'
 LIMIT 1
---
    private function getOwnedKelas(int $idKelas): ?array
    {
        $kelasModel = new KelasModel();

        return $kelasModel
            ->where('id', $idKelas)
            ->where('id_guru', session()->get('id'))
            ->first();

SELECT *
FROM `materi`
WHERE `materi`.`id` = 28
---
    private function getOwnedMateri(int $idMateri): ?array
    {
        $materiModel = new MateriModel();

        $materi = $materiModel->find($idMateri);

SELECT *
FROM `materi`
WHERE `id_kelas` = '21'
ORDER BY `id` DESC
---
    public function index($idKelas)
    {
        if ($redirect = $this->ensureGuru()) {
            return $redirect;
        }

        $kelas = $this->getOwnedKelas((int) $idKelas);

        if (! $kelas) {
            throw PageNotFoundException::forPageNotFound('Kelas tidak ditemukan.');
        }

        $materiModel = new MateriModel();

        $materi = $materiModel
            ->where('id_kelas', $idKelas)
            ->orderBy('id', 'DESC')
            ->findAll();