app/Controllers/Siswa.php

    public function kelasDetail($id)
    {
        if ($redirect = $this->ensureSiswa()) {
            return $redirect;
        }

        $idUser = session()->get('id');

        $siswaKelasModel = new SiswaKelasModel();

        if (! $siswaKelasModel->isSiswaJoined($idUser, $id)) {
            return redirect()
                ->to('/siswa/kelas')
                ->with('error', 'Anda belum bergabung dengan kelas tersebut.');
        }

        $kelasModel   = new KelasModel();
        $materiModel  = new MateriModel();
        $diskusiModel = new DiskusiModel();
        $userModel    = new UserModel();

        $kelas = $kelasModel->find($id);

        if (! $kelas) {
            return redirect()
                ->to('/siswa/kelas')
                ->with('error', 'Kelas tidak ditemukan.');
        }

        $materi = $materiModel
            ->where('id_kelas', $id)
            ->findAll();
---
SELECT *
FROM `kelas`
WHERE `kelas`.`id` = '19'
SELECT *
FROM `materi`
WHERE `id_kelas` = '19'


        $userMap = [];

        foreach ($userModel->select('id, nama')->findAll() as $user) {
---
SELECT `id`, `nama`
FROM `users`

    public function cekKodeKelas()
    {
        if ($redirect = $this->ensureSiswa()) {
            return $redirect;
        }

        $rules = [
            'kode_kelas' => [
                'label' => 'Kode Kelas',
                'rules' => 'required',
            ],
        ];

        if (! $this->validate($rules)) {
            return redirect()
                ->back()
                ->withInput()
                ->with('error', 'Kode kelas wajib diisi.');
        }

        $kodeKelas = trim((string) $this->request->getPost('kode_kelas'));
        $idUser = session()->get('id');

        $kelasModel = new KelasModel();
        $siswaKelasModel = new SiswaKelasModel();

        $kelas = $kelasModel
            ->where('kode_kelas', $kodeKelas)
            ->first();
---
SELECT *
FROM `kelas`
WHERE `kode_kelas` = 'C179D1'
 LIMIT 1

                ->with('success', 'Anda sudah bergabung di kelas tersebut.');
        }

        $siswaKelasModel->insert([
            'id_user'  => $idUser,
            'id_kelas' => $kelas['id'],
        ]);
---
INSERT INTO `siswa_kelas` (`id_user`, `id_kelas`) VALUES ('17', '19')