app/Controllers/Siswa.php

SELECT *
FROM `kelas`
---
    public function index()
    {
        $kelasModel = new KelasModel();
        $data['kelas'] = $kelasModel->findAll();

SELECT `kelas`.*
FROM `siswa_kelas`
JOIN `kelas` ON `kelas`.`id` = `siswa_kelas`.`id_kelas`
WHERE `siswa_kelas`.`id_user` = '9'
---
    public function kelas()
    {
        $id_user = session()->get('id');
        $db = \Config\Database::connect();
        $builder = $db->table('siswa_kelas');
        $builder->select('kelas.*');
        $builder->join('kelas', 'kelas.id = siswa_kelas.id_kelas');
        $builder->where('siswa_kelas.id_user', $id_user);
        $kelas = $builder->get()->getResultArray();

SELECT *
FROM `kelas`
WHERE `kelas`.`id` = '17'
SELECT *
FROM `materi`
WHERE `id_kelas` = '17'
SELECT *
FROM `users`
---
    public function kelasDetail($id)
    {
        $kelasModel = new KelasModel();
        $materiModel = new MateriModel();
        $diskusiModel = new DiskusiModel();
        $userModel = new UserModel();

        $kelas = $kelasModel->find($id);
        $materi = $materiModel->where('id_kelas', $id)->findAll();
        $diskusi = $diskusiModel->where('id_kelas', $id)->orderBy('created_at', 'ASC')->findAll();

        // Buat map id_user => nama
        $userList = $userModel->findAll();

SELECT *
FROM `kelas`
WHERE `kode_kelas` = 'S-PK01'
 LIMIT 1
SELECT *
FROM `siswa_kelas`
WHERE `id_user` = '16'
AND `id_kelas` = '15'
 LIMIT 1
INSERT INTO `siswa_kelas` (`id_user`, `id_kelas`) VALUES ('16', '15')
---
    public function cekKodeKelas()
    {
        $kode = $this->request->getPost('kode_kelas');
        $id_user = session()->get('id');

        $kelasModel = new KelasModel();
        $siswaKelasModel = new SiswaKelasModel();

        $kelas = $kelasModel->where('kode_kelas', $kode)->first();

        if (!$kelas) {
            return redirect()->back()->with('error', 'Kode kelas tidak ditemukan.');
        }

        // Cek apakah siswa sudah bergabung
        $sudah = $siswaKelasModel
            ->where('id_user', $id_user)
            ->where('id_kelas', $kelas['id'])
            ->first();

        if (!$sudah) {
            $siswaKelasModel->insert([
                'id_user' => $id_user,
                'id_kelas' => $kelas['id']
            ]);