app/Models/SiswaKelasModel.php

    public function getKelasBySiswa($idUser): array
    {
        return $this->select('kelas.*')
            ->join('kelas', 'kelas.id = siswa_kelas.id_kelas')
            ->where('siswa_kelas.id_user', $idUser)
            ->orderBy('kelas.id', 'DESC')
            ->findAll();
---
SELECT `kelas`.*
FROM `siswa_kelas`
JOIN `kelas` ON `kelas`.`id` = `siswa_kelas`.`id_kelas`
WHERE `siswa_kelas`.`id_user` = '17'
ORDER BY `kelas`.`id` DESC

    public function countKelasBySiswa($idUser): int
    {
        return $this->where('id_user', $idUser)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `siswa_kelas`
WHERE `id_user` = '17'

    public function isSiswaJoined($idUser, $idKelas): bool
    {
        return $this->where('id_user', $idUser)
            ->where('id_kelas', $idKelas)
            ->first() !== null;
---
SELECT *
FROM `siswa_kelas`
WHERE `id_user` = '17'
AND `id_kelas` = '19'
 LIMIT 1